           03 AAAAAAA PIC X(1) VALUE X'F0'.
           03 BBBBBBB PIC X(1) VALUE X'F2'.
           03 CCCCCCC PIC X(1) VALUE X'F4'.
           03 DDDDDDD PIC X(1) VALUE X'F6'.
           03 EEEEEEE PIC X(1).
 
