      * FFILE.CBL
      *
           07  VFILE.
             09  NUM1                         PIC  9(04).
             09  REC-DATA                     PIC  X(72).
             09  NUM2                         PIC  ZZZ9.
