000010 IDENTIFICATION         DIVISION.
000020 PROGRAM-ID.            COBSUB1.
000030*
000040 ENVIRONMENT            DIVISION.
000050
000060 DATA                   DIVISION.
000070 WORKING-STORAGE        SECTION.
000080*
000120 LINKAGE                SECTION.
000110 01  COB2C-AREA.
           03  PRM1                     PIC  S9(08) COMP-5.
           03  PRM2                     PIC  X(10).
      *
000170 PROCEDURE              DIVISION
000190                        USING     COB2C-AREA.
000200/
000210*
000220*
000230 MAIN-SEC               SECTION.
000240     MOVE               0        TO        PROGRAM-STATUS.
000250
000260     DISPLAY 'THIS IS COBSUB1 WITH PARM ' PRM1.
000270     DISPLAY '                VALUE  IS ' PRM2.
000280
000290     CONTINUE.
000300     GOBACK.
000310 MAIN-SEC-E.
000320     EXIT PROGRAM.
