000010*>comp pack performance test
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.    COBMAIN.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000080*--1-V--+----2----+----3----+----4----+----5----+----6----+----7--
000090 01 WORK-AREA.
000100    03  FILLER        PIC  X(16)  VALUE '###WK-AREA   ###'.
000110    03  IDX            PIC  S9(13) COMP-5.
000120    03  LOOP-COUNT     PIC  S9(13) COMP-5  VALUE 100000000.
000130*
000140    03  A-COMP-5       PIC  S9(13) COMP-5  VALUE  ZERO.
000150    03  B-COMP-5       PIC  S9(13) COMP-5  VALUE  ZERO.
000160*
000170    03  A-COMP-3       PIC  S9(13) COMP-3  VALUE  ZERO.
000180    03  B-COMP-3       PIC  S9(13) COMP-3  VALUE  ZERO.
000190*
000200    03  A-COMP         PIC  S9(13) COMP-3  VALUE  ZERO.
000210    03  B-COMP         PIC  S9(13) COMP-3  VALUE  ZERO.
000220*
000230    03  ST-TIME        PIC   9(08).
000240    03  EN-TIME        PIC   9(08).
000250*
000260    03  EXEC-PTN       PIC   9(01).
000270*
000280 LINKAGE           SECTION.
000290 01 EXEC-AREA.
000300    03  EXEC-LL        PIC   9(04) COMP-5.
000310    03  EXEC-PARA      PIC   X(80).
000320*
000330*
000340 PROCEDURE DIVISION    USING  EXEC-AREA.
000350*
000360 MAIN                  SECTION.
000370*
000380     DISPLAY 'LL:' EXEC-LL.
000390     DISPLAY 'PARA:' EXEC-PARA(1 : EXEC-LL) '::'
000400     MOVE  EXEC-PARA(1 : 1)  TO  EXEC-PTN.
000410*
000420     EVALUATE  EXEC-PTN
000430     WHEN  1
000440         PERFORM  SEC-BLANK
000450     WHEN  2
000460         PERFORM  SEC-COMP5
000470     WHEN  3
000480         PERFORM  SEC-COMP
000490     WHEN  4
000500         PERFORM  SEC-COMP3
000510     WHEN  OTHER
000520         MOVE  4  TO  PROGRAM-STATUS
000530         DISPLAY 'PTN ERROR'
000540     END-EVALUATE
000550*
000560     GOBACK.
000570 MAIN-E.
000580*
000590 SEC-BLANK              SECTION.
000600*
000610* PTN-1
000620     ACCEPT ST-TIME FROM TIME.
000630     PERFORM WITH TEST BEFORE
000640         VARYING IDX FROM 1 BY 1
000650         UNTIL IDX > LOOP-COUNT
000660             CONTINUE
000670     END-PERFORM
000680     ACCEPT EN-TIME FROM TIME.
000690     DISPLAY 'BLANK(CONTINUE)'.
000700     DISPLAY 'ST:' ST-TIME.
000710     DISPLAY 'EN:' EN-TIME.
000720     CONTINUE.
000730 SEC-BLANK-E.
000740*
000750 SEC-COMP5              SECTION.
000760*
000770* PTN-2
000780     ACCEPT ST-TIME FROM TIME.
000790     PERFORM WITH TEST BEFORE
000800         VARYING IDX FROM 1 BY 1
000810         UNTIL IDX > LOOP-COUNT
000820             COMPUTE B-COMP-5 = B-COMP-5 + 1
000830     END-PERFORM
000840     ACCEPT EN-TIME FROM TIME.
000850     DISPLAY 'COMP-5(COMPUTE)'.
000860     DISPLAY 'ST:' ST-TIME.
000870     DISPLAY 'EN:' EN-TIME.
000880*
000890     CONTINUE.
000900 SEC-COMP5-E.
000910*
000920*
000930 SEC-COMP               SECTION.
000940*
000950* PTN-3
000960     ACCEPT ST-TIME FROM TIME.
000970     PERFORM WITH TEST BEFORE
000980         VARYING IDX FROM 1 BY 1
000990         UNTIL IDX > LOOP-COUNT
001000             COMPUTE B-COMP = B-COMP + 1
001010     END-PERFORM
001020     ACCEPT EN-TIME FROM TIME.
001030     DISPLAY 'COMP(COMPUTE)'.
001040     DISPLAY 'ST:' ST-TIME.
001050     DISPLAY 'EN:' EN-TIME.
001060     CONTINUE.
001070 SEC-COMP-E.
001080*
001090*
001100 SEC-COMP3              SECTION.
001110*
001120* PTN-4
001130     ACCEPT ST-TIME FROM TIME.
001140     PERFORM WITH TEST BEFORE
001150         VARYING IDX FROM 1 BY 1
001160         UNTIL IDX > LOOP-COUNT
001170             COMPUTE B-COMP-3 = B-COMP-3 + 1
001180     END-PERFORM
001190     ACCEPT EN-TIME FROM TIME.
001200     DISPLAY 'COMP-3(COMPUTE)'.
001210     DISPLAY 'ST:' ST-TIME.
001220     DISPLAY 'EN:' EN-TIME.
001230     CONTINUE.
001240 SEC-COMP3-E.
001250*
001260 END PROGRAM COBMAIN.
