000010 IDENTIFICATION   DIVISION.
000020 PROGRAM-ID.      FILEIO.
000030
000040 ENVIRONMENT      DIVISION.
000050 INPUT-OUTPUT     SECTION.
000060 FILE-CONTROL.
000070     SELECT  V-OTFILE  ASSIGN TO     VFILE
000080             ORGANIZATION  IS    SEQUENTIAL.
000090     SELECT  F-OTFILE  ASSIGN TO     FFILE
000100             ORGANIZATION  IS    SEQUENTIAL.
000110
000120 DATA             DIVISION.
000130 FILE             SECTION.
000140 FD      V-OTFILE
000150         RECORD    IS  VARYING IN SIZE
000160         DEPENDING ON  V-LL.
000170 01      V-REC01.
000180     COPY  VFILE.
000190
000200 FD      F-OTFILE.
000240 01      F-REC01.
000250     COPY  FFILE.
000260
000270 WORKING-STORAGE  SECTION.
000300
000310 01     WORK-A.
000320   03   V-LL            PIC     9(04)   COMP.
000330   03   II              PIC     9(04)   COMP.
000340   03   N-RECORD        PIC     9(04)   COMP  VALUE  10.
000350   03   ISEOF           PIC     9(04)   COMP.
000360
000370 PROCEDURE        DIVISION.
000380 MAIN             SECTION.
000390     PERFORM  V-SEC-R.
000400     PERFORM  F-SEC-R.
000410     EXIT PROGRAM.
000420 MAIN-EX.
000430/
000440 V-SEC-R  SECTION.
000450
000460     OPEN  INPUT  V-OTFILE.
000470
000480     DISPLAY 'VFILE'
000490     MOVE  0  TO  ISEOF.
000500     PERFORM TEST BEFORE  UNTIL  ISEOF = 1
000510       READ   V-OTFILE
000520         AT  END  GO TO V-SEC-R-EX
000530       END-READ
000540       DISPLAY  V-REC01(1:V-LL)
000550
000560     END-PERFORM.
000570
000580     CLOSE  V-OTFILE.
000590
000600 V-SEC-R-EX.
000610/
000620 F-SEC-R  SECTION.
000630
000640     OPEN  INPUT  F-OTFILE.
000650
000660     DISPLAY 'FFILE'
000670     MOVE  0  TO  ISEOF.
000680     PERFORM TEST BEFORE  UNTIL  ISEOF = 1
000690       READ   F-OTFILE
000700         AT  END  GO TO F-SEC-R-EX
000710       END-READ
000720       DISPLAY  F-REC01
000730
000740     END-PERFORM.
000750
000760     CLOSE  F-OTFILE.
000770
000780 F-SEC-R-EX.
000790 EXIT-PROGRAM.
