000010 @OPTIONS CHECK(NUMERIC)
000011 IDENTIFICATION         DIVISION.
000020 PROGRAM-ID.            COBMAIN.
000030*
000040 ENVIRONMENT            DIVISION.
000050*
000060 DATA                   DIVISION.
000070 WORKING-STORAGE        SECTION.
000080*
000090 01  WORK-AREA-A.
000100     03  SR-NAME                  PIC  X(08).
000180/
000200 PROCEDURE              DIVISION .
000230*
000240 MAIN-SEC               SECTION.
000250     MOVE               0        TO        PROGRAM-STATUS.
000300     DISPLAY 'Hello World'.
000420     CONTINUE.
000440 MAIN-SEC-E.
000450     EXIT PROGRAM.
