000010 IDENTIFICATION         DIVISION.
000020 PROGRAM-ID.            PART.
000030*
000040 ENVIRONMENT            DIVISION.
000050*
000060 DATA                   DIVISION.
000070 WORKING-STORAGE        SECTION.
000080*
000090 01  WORK-AREA-A.
000100     03  X2020          PIC  X(2) VALUE X'2020'.
000110     03  X8140          PIC  X(2) VALUE X'8140'.
000120*
000130     03  N-STR          PIC  N(4) VALUE NC'ÇPÇQÅ@ÇS'.
000140     03  X-STR          PIC  X(4) VALUE 'ÇPÇQ'.
000150*
000160*  X'xx'ÇÕÇmçÄñ⁄Ç…ïsâ¬Ç»ÇÃÇ≈ÅAÇwÇ≈ê›íËÇµÇΩÇmÇ≈çƒíËã`Ç∑ÇÈ
000170*
000180     03  X-X2020                      PIC X(2)  VALUE  X'2020'.
000190     03  N-X2020    REDEFINES X-X2020 PIC N(1).
000200     03  X-X8140                      PIC X(2)  VALUE  X'8140'.
000210     03  N-X8140    REDEFINES X-X8140 PIC N(1).
000220/
000230 PROCEDURE              DIVISION .
000240*
000250 MAIN-SEC               SECTION.
000260*
000270     IF N-STR(2:1) = NC'ÇQ'  THEN
000280       DISPLAY 'ANY:N-STR true'
000290     ELSE
000300       DISPLAY 'N-STR false'
000310     END-IF.
000320*
000330     DISPLAY 'N-X2020' N-X2020.
000340     DISPLAY 'N-X8140' N-X8140.
000350     IF N-X2020 = N-X8140  THEN
000360       DISPLAY 'ASP:N-X2020 eq N-X8140'
000370     ELSE
000380       DISPLAY 'NSP:X-X2020 not X-X8140'
000390     END-IF.
000400*
000410* compile-error IF N = X
000420*     IF N-STR(2:1) = X-STR(3:2) THEN
000430*       DISPLAY 'N-STR = X-STR true'
000440*     ELSE
000450*       DISPLAY 'N-STR = X-STR false'
000460*     END-IF.
000470
000480*
000490     CONTINUE.
000500 MAIN-SEC-E.
000510     EXIT PROGRAM.
