000010 IDENTIFICATION   DIVISION.
000020 PROGRAM-ID.      FILEW.
000030
000040 ENVIRONMENT      DIVISION.
000050 INPUT-OUTPUT     SECTION.
000060 FILE-CONTROL.
000070     SELECT  V-OTFILE  ASSIGN TO     VFILE
000080             ORGANIZATION  IS LINE   SEQUENTIAL.
000090
000100 DATA             DIVISION.
000110 FILE             SECTION.
000120 FD      V-OTFILE
000130         RECORD    IS  VARYING IN SIZE
000140         DEPENDING ON  V-LL.
000150 01      V-REC01.
000160     COPY  SORTREC.
000170
000180 WORKING-STORAGE  SECTION.
000190 01     CONSTANT-A.
000200   03   CN-LL1          PIC     9(08)   VALUE  1024.
000210   03   CN-LL2          PIC     9(08)   VALUE   160.
000220   03   CN-LL3          PIC     9(08)   VALUE   320.
000230*
000240 01     WORK-A.
000250   03   V-LL            PIC     9(04)   COMP.
000260   03   II              PIC     9(08)   COMP.
000270*
000280   03   N-RECS          PIC     9(13)   COMP.
000290   03   N-KEYS1         PIC     9(08)   COMP  VALUE    10.  *> TEN
000300   03   N-KEYS2         PIC     9(08)   COMP  VALUE 10000.  *> KOBAN
000310   03   N-KEYS3-1       PIC     9(08)   COMP  VALUE    20.  *> TORIMEI
000320   03   N-KEYS3-2       PIC     9(08)   COMP  VALUE     2.  *> FUZOKU
000330
000340   03   X-KEYS1                         PIC     X(04).
000350   03   R-KEYS1   REDEFINES  X-KEYS1    PIC     9999.
000360   03   X-KEYS2                         PIC     X(08).
000370   03   R-KEYS2   REDEFINES  X-KEYS2    PIC     99999999.
000380   03   X-KEYS3-1                       PIC     X(04).
000390   03   R-KEYS3-1 REDEFINES  X-KEYS3-1  PIC     9999.
000400   03   X-KEYS3-2                       PIC     X(04).
000410   03   R-KEYS3-2 REDEFINES  X-KEYS3-2  PIC     9999.
000420
000430   03   I-RECS          PIC     9(13)   COMP.
000440   03   I-KEYS1         PIC     9(08)   COMP.
000450   03   I-KEYS2         PIC     9(08)   COMP.
000460   03   I-KEYS3         PIC     9(08)   COMP.
000470
000480   03   ISEOF           PIC     9(04)   COMP.
000490   03   RANSU           PIC     9V99999999.
000500
000501 01  TIMEVAL-A.
000502   03   TIMEVAL         PIC     9(08).
000503   03   TIME1           PIC     9(08).
000504   03   TIME2           PIC     9(08).
000505
000506
000507
000510 LINKAGE          SECTION.
000520 01 EXEC-PARM-A.
000530   03   EXEC-LL         PIC  S9(04)  COMP-5.
000540   03   EXEC-PARM       PIC  X(80).
000550
000560
000570 PROCEDURE        DIVISION  USING  EXEC-PARM-A.
000580 MAIN             SECTION.
000590*
000600     IF  EXEC-LL  NOT =  ZERO  THEN
000610       UNSTRING  EXEC-PARM  DELIMITED BY  ','  OR  ':'
000620         INTO    X-KEYS1  X-KEYS2  X-KEYS3-1  X-KEYS3-2
000630       END-UNSTRING
000640
000650       MOVE  R-KEYS1      TO  N-KEYS1
000660       MOVE  R-KEYS2      TO  N-KEYS2
000670       MOVE  R-KEYS3-1    TO  N-KEYS3-1
000680       MOVE  R-KEYS3-2    TO  N-KEYS3-2
000690
000700     END-IF
000710
000720     DISPLAY 'SORT-DATA MAKE'
000730     DISPLAY '  USAGE: SORT001 "N1,N2,N3-1,N3-2"'
000740     DISPLAY '    N1=9999 AS TEN.  N2=99999999 AS KOZA per TEN'
000750     DISPLAY '    N3-1=9999 AS MEISAI per KOZA,  N3-2=9999 AS FUZOKU per KOZA'
000760     DISPLAY 'KEYS1 * (KEYS2 + KEYS2*(KEYS3-1 + KEYS3-2))'
000770     DISPLAY N-KEYS1 '*' '(' N-KEYS2 '+' N-KEYS2 '*' '(' N-KEYS3-1 '+' N-KEYS3-2 '))' 
000780     COMPUTE N-RECS = N-KEYS1 * (N-KEYS2 + N-KEYS2 * (N-KEYS3-1 + N-KEYS3-2))
000790     DISPLAY N-RECS
000800
000801     ACCEPT  TIME1  FROM  TIME.
000810     PERFORM  SORTD-MAKE.
000811     ACCEPT  TIME2  FROM  TIME.
000812
000813     DISPLAY  'START :' TIME1.
000814     DISPLAY  'END   :' TIME2.
000815
000820     EXIT PROGRAM.
000830 MAIN-EX.
000840/
000850 SORTD-MAKE  SECTION.
000860
000870     OPEN  OUTPUT  V-OTFILE
000871
000880     MOVE  ZERO    TO  I-RECS
000890     MOVE  ':'     TO  DELIM0
000900     MOVE  ','     TO  DELIM1  DELIM2  DELIM3
000910   
000920* TEN-LOOG
000930     PERFORM TEST BEFORE VARYING  I-KEYS1
000940       FROM  1  BY  1  UNTIL I-KEYS1  >  N-KEYS1 
000950*
000960       MOVE  I-KEYS1  TO  KEY1 
000970* KOBAN-LOOP
000980       PERFORM  TEST BEFORE  VARYING  I-KEYS2
000990         FROM  1  BY  1  UNTIL  I-KEYS2  >  N-KEYS2 
001000*
001010         MOVE  I-KEYS2     TO  KEY2 
001020         MOVE  ZERO        TO  KEY3 
001030         MOVE  SPACE       TO  BODY1 
001040         MOVE  'KOZA'      TO  BODY1 
001050** KOZA-WRITE
001060         MOVE  CN-LL1      TO  V-LL 
001070         PERFORM           SORTD-WRITE
001080* MEISAI-LOOP
001090         PERFORM  TEST  BEFORE  VARYING  I-KEYS3
001100           FROM  1  BY  1  UNTIL  I-KEYS3  >  N-KEYS3-1 
001110*
001120           COMPUTE  RANSU = FUNCTION RANDOM 
001130           MOVE  RANSU(2:8)  TO  KEY3 
001140           MOVE  SPACE       TO  BODY2 
001150           MOVE  'MEISAI'    TO  BODY2 
001160** MEISAI-WRITE
001170           MOVE  CN-LL2     TO  V-LL 
001180           PERFORM           SORTD-WRITE
001190         END-PERFORM
001200* FUZOKU-LOOP
001210         PERFORM  TEST  BEFORE  VARYING  I-KEYS3
001220           FROM  1  BY  1  UNTIL  I-KEYS3  >  N-KEYS3-2 
001230*
001240           MOVE  I-KEYS3     TO  KEY3 
001250           MOVE  SPACE       TO  BODY3 
001260           MOVE  'FUZOKU'    TO  BODY3 
001270** FOZOKU-WRITE
001280           MOVE  CN-LL3      TO  V-LL 
001290           PERFORM           SORTD-WRITE 
001300         END-PERFORM
001310       END-PERFORM
001320     END-PERFORM
001330
001340     CLOSE  V-OTFILE
001350*
001360     EXIT SECTION.
001370 SORTD-MAKE-E.
001380/
001390 SORTD-WRITE    SECTION.
001400     ADD   1       TO  I-RECS
001410     MOVE  I-RECS  TO  RECNO
001420     WRITE  V-REC01
001430*
001440     EXIT SECTION.
001450 SORTD-WRITE-E.
001460/
001470 EXIT-PROGRAM.
