000010 IDENTIFICATION   DIVISION.
000020 PROGRAM-ID.      FILEW.
000030
000040 ENVIRONMENT      DIVISION.
000050 INPUT-OUTPUT     SECTION.
000060 FILE-CONTROL.
000070     SELECT  V-INFILE  ASSIGN TO     VFILEIN
000080             ORGANIZATION  IS LINE   SEQUENTIAL.
000090
000100     SELECT  V-OTFILE  ASSIGN TO     VFILEOT
000110             ORGANIZATION  IS LINE   SEQUENTIAL.
000120
000130     SELECT  SORT-FILE  ASSIGN  TO  SORTWK01.
000140
000150
000160
000170 DATA             DIVISION.
000180 FILE             SECTION.
000190 FD      V-INFILE
000200         RECORD    IS  VARYING IN SIZE
000210         DEPENDING ON  V-LLIN.
000220 01      V-REC01-IN.
000230     COPY  SORTREC.
000240
000250 FD      V-OTFILE
000260         RECORD    IS  VARYING IN SIZE
000270         DEPENDING ON  V-LLOT.
000280 01      V-REC01-OT.
000290     COPY  SORTREC.
000300
000310 SD      SORT-FILE
000320         RECORD     IS  VARYING  IN SIZE
000330         DEPENDING  ON  V-SORT.
000340 01      SORT-REC.
000350     COPY  SORTREC.
000360
000370 WORKING-STORAGE  SECTION.
000380 01     CONSTANT-A.
000390   03   FILLER          PIC     X(08)   VALUE '**CONS**'.
000400*
000410 01     WORK-A.
000420   03   V-LLIN          PIC     9(04)   COMP.
000430   03   V-LLOT          PIC     9(04)   COMP.
000440   03   V-SORT          PIC     9(04)   COMP.
000450
000460   03   II              PIC     9(08)   COMP.
000470*
000480   03   I-RECS          PIC     9(13)   COMP.
000490   03   I-KEYS1         PIC     9(08)   COMP.
000500   03   I-KEYS2         PIC     9(08)   COMP.
000510   03   I-KEYS3         PIC     9(08)   COMP.
000520
000530   03   ISEOF           PIC     9(04)   COMP.
000540   03   KBN             PIC     X(01)   VALUE  '0'.
000550
000560 01  TIMEVAL-A.
000570   03   TIMEVAL         PIC     9(08).
000580   03   TIME-JS         PIC     9(08).
000590   03   TIME-JE         PIC     9(08).
000600   03   TIME-SIS        PIC     9(08).
000610   03   TIME-SIE        PIC     9(08).
000620   03   TIME-SOS        PIC     9(08).
000630   03   TIME-SOE        PIC     9(08).
000640
000650
000660
000670 LINKAGE          SECTION.
000680 01 EXEC-PARM-A.
000690   03   EXEC-LL         PIC  S9(04)  COMP-5.
000700   03   EXEC-PARM       PIC  X(80).
000710
000720
000730 PROCEDURE        DIVISION  USING  EXEC-PARM-A.
000740 MAIN             SECTION.
000750*
000760     IF  EXEC-LL  NOT =  ZERO  THEN
000770       MOVE  EXEC-PARM(1:1)  TO  KBN
000780     END-IF
000790
000800     ACCEPT  TIME-JS  FROM  TIME
000810     SORT  SORT-FILE 
000820           ON  DESCENDING  KEY1  OF  SORT-REC
000830               DESCENDING  KEY2  OF  SORT-REC
000840               DESCENDING  KEY3  OF  SORT-REC
000850       INPUT   PROCEDURE  SORT-INPUT
000860       OUTPUT  PROCEDURE  SORT-OUTPUT
000870
000880     ACCEPT  TIME-JE  FROM  TIME
000890*
000900     DISPLAY  'STARTJ  :' TIME-JS
000910     DISPLAY  'SORTIN-S:' TIME-SIS
000920     DISPLAY  'SORTIN-E:' TIME-SIE
000930     DISPLAY  'SORTOU-S:' TIME-SOS
000940     DISPLAY  'SORTOU-E:' TIME-SOE
000950     DISPLAY  'ENDJ    :' TIME-JE
000960
000970     EXIT PROGRAM.
000980 MAIN-EX.
000990/
001000 SORT-INPUT      SECTION.
001010
001020     ACCEPT  TIMEVAL  FROM  TIME
001030     DISPLAY  'SORT-INPUT-START:' TIMEVAL
001040*
001050     OPEN  INPUT  V-INFILE
001060
001070     ACCEPT  TIME-SIS  FROM  TIME.
001080     MOVE  0  TO  ISEOF
001090     PERFORM  TEST  BEFORE  UNTIL  ISEOF  =  1
001100       READ  V-INFILE
001110         AT  END  GO TO  SORTIN-END
001120       END-READ
001130
001140       MOVE  V-LLIN  TO  V-SORT
001150       display V-SORT
001151       MOVE  V-REC01-IN(1:V-LLIN)  TO  SORT-REC(1:V-SORT)
001160       RELEASE  SORT-REC
001170     END-PERFORM
001171
001180     CONTINUE.
001190 SORTIN-END.
001200     ACCEPT  TIME-SIE  FROM  TIME
001210     CLOSE  V-INFILE
001220
001230     ACCEPT  TIMEVAL  FROM  TIME
001240     DISPLAY  'SORT-INPUT-ENDED:' TIMEVAL
001250*
001260     EXIT SECTION.
001270 SORT-INPUT-E.
001280/
001290 SORT-OUTPUT       SECTION.
001300*
001310     ACCEPT  TIMEVAL  FROM  TIME
001320     DISPLAY  'SORT-OUTPUT-START:' TIMEVAL
001330*
001340     OPEN  OUTPUT  V-OTFILE
001350
001360     ACCEPT  TIME-SOS  FROM  TIME
001370     MOVE  0  TO  ISEOF
001380     PERFORM  TEST  BEFORE  UNTIL  ISEOF  =  1
001390       RETURN  SORT-FILE
001400         AT  END  GO TO SORTOUT-END
001410       END-RETURN
001420
001430       MOVE  V-SORT  TO  V-LLOT
001440       MOVE  SORT-REC(1:V-SORT)  TO  V-REC01-OT(1:V-LLOT)
001450
001460       WRITE  V-REC01-OT
001470     END-PERFORM
001480
001481     CONTINUE.
001490 SORTOUT-END.
001500     ACCEPT  TIME-SOE  FROM  TIME
001510     CLOSE  V-OTFILE
001520
001530     ACCEPT  TIMEVAL  FROM  TIME
001540     DISPLAY  'SORT-OUTPUT-ENDED:' TIMEVAL
001550*
001560     EXIT SECTION.
001570 SORT-OUTPUT-E.
001580/
001590 EXIT-PROGRAM.
