000010 IDENTIFICATION   DIVISION.
000020 PROGRAM-ID.      FILEW.
000030
000040 ENVIRONMENT      DIVISION.
000050 INPUT-OUTPUT     SECTION.
000060 FILE-CONTROL.
000070     SELECT  V-INFILE  ASSIGN TO     VFILEIN
000080             ORGANIZATION  IS LINE   SEQUENTIAL.
000090
000100     SELECT  V-OTFILE  ASSIGN TO     VFILEOT
000110             ORGANIZATION  IS LINE   SEQUENTIAL.
000120
000130     SELECT  SORT-FILE  ASSIGN  TO  SORTWK01.
000140
000150 DATA             DIVISION.
000160 FILE             SECTION.
000170 FD      V-INFILE
000180         RECORD    IS  VARYING IN SIZE  DEPENDING ON  V-LLIN.
000190 01      V-REC01-IN.
000200     COPY  SORTREC.
000210
000220 FD      V-OTFILE
000230         RECORD    IS  VARYING IN SIZE  DEPENDING ON  V-LLOT.
000240 01      V-REC01-OT.
000250     COPY  SORTREC.
000260
000270 SD      SORT-FILE
000280         RECORD    IS  VARYING IN SIZE  DEPENDING ON  V-SORT.
000290 01      SORT-REC.
000300     COPY  SORTREC.
000310
000320 WORKING-STORAGE  SECTION.
000330 01     CONSTANT-A.
000340   03   FILLER          PIC     X(08)   VALUE '**CONS**'.
000350*
000360 01     SAVE-A.
000370   03   SV-REC.
000380      COPY  SORTREC. 
000390*
000400 01     WORK-A.
000410   03   V-LLIN          PIC     9(04)   COMP.
000420   03   V-LLOT          PIC     9(04)   COMP.
000430   03   V-SORT          PIC     9(04)   COMP.
000440   03   V-LLSV          PIC     9(04)   COMP.
000450
000460   03   II              PIC     9(08)   COMP.
000461   03   N-SORT          PIC     9(08)   COMP.
000470*
000480   03   ISEOF           PIC     9(04)   COMP.
000490   03   ISBREAK         PIC     9(04)   COMP.
000500   03   KBN             PIC     X(01)   VALUE  '0'.
000510
000520 01  TIMEVAL-A.
000530   03   TIMEVAL         PIC     9(08).
000540
000550 LINKAGE          SECTION.
000560 01 EXEC-PARM-A.
000570   03   EXEC-LL         PIC  S9(04)  COMP-5.
000580   03   EXEC-PARM       PIC  X(80).
000590
000600
000610 PROCEDURE        DIVISION  USING  EXEC-PARM-A.
000620 MAIN             SECTION.
000630*
000640     ACCEPT  TIMEVAL  FROM  TIME
000650     DISPLAY  'JOBSTART :' TIMEVAL
000660     DISPLAY  'JOBSTART :' TIMEVAL  UPON  SYSERR
000661*
000670     IF  EXEC-LL  NOT =  ZERO  THEN
000680       MOVE  EXEC-PARM(1:1)  TO  KBN
000690     END-IF
000700
000710     OPEN  INPUT   V-INFILE
000720     OPEN  OUTPUT  V-OTFILE
000730     MOVE  0  TO  ISEOF
000740** FIRST-READ
000750     READ  V-INFILE
000760       AT  END  MOVE  1  TO ISEOF
000770     END-READ
000780** READ TO SAVA 
000790     MOVE  V-LLIN                TO  V-LLSV
000800     MOVE  V-REC01-IN(1:V-LLIN)  TO  SV-REC(1:V-LLSV)
000810
000811     MOVE  1  TO  N-SORT
000820     PERFORM  TEST  BEFORE 
000830       UNTIL  ISEOF  =  1
000840       SORT  SORT-FILE
000850         ON  DESCENDING  KEY1  OF  SORT-REC
000860             DESCENDING  KEY2  OF  SORT-REC
000870             DESCENDING  KEY3  OF  SORT-REC
000880         INPUT   PROCEDURE  SORT-INPUT
000890         OUTPUT  PROCEDURE  SORT-OUTPUT
000891       ADD  1  TO  N-SORT
000900     END-PERFORM
000910     CLOSE  V-INFILE
000920     CLOSE  V-OTFILE
000930
000940     ACCEPT  TIMEVAL  FROM  TIME
000950     DISPLAY  'JOBENDED :'  TIMEVAL
000960     DISPLAY  'JOBENDED :'  TIMEVAL  UPON  SYSERR
000961*
000970     EXIT PROGRAM.
000980 MAIN-EX.
000990/
001000 SORT-INPUT      SECTION.
001010
001020     ACCEPT  TIMEVAL  FROM  TIME
001030     DISPLAY  ' SORTI-START:' N-SORT ':' TIMEVAL
001040
001050     MOVE  0  TO  ISBREAK
001060     PERFORM  TEST  BEFORE  UNTIL  ISEOF  =  1  OR  ISBREAK  =  1
001070** WRITE READ-RECORD TO SORT-REC
001080       MOVE  V-LLIN  TO  V-SORT
001090       MOVE  V-REC01-IN(1:V-LLIN)  TO  SORT-REC(1:V-SORT)
001100       RELEASE  SORT-REC
001110** READ-RECORD TO SV-RECORD
001120       MOVE  V-LLIN                TO  V-LLSV
001130       MOVE  V-REC01-IN(1:V-LLIN)  TO  SV-REC(1:V-LLSV)
001140** NEXT-READ
001150       READ  V-INFILE
001160         AT  END  MOVE  1  TO  ISEOF
001170       END-READ
001180       IF  ISEOF NOT = 1  THEN
001181         EVALUATE  KBN
001192         WHEN '1'
001193           IF  KEY1 OF V-REC01-IN NOT = KEY1 OF SV-REC  THEN
001194             MOVE  1  TO  ISBREAK 
001195           END-IF
001196         WHEN '2'
001197           IF  KEY1 OF V-REC01-IN NOT = KEY1 OF SV-REC  OR
001198               KEY2 OF V-REC01-IN NOT = KEY2 OF SV-REC  THEN
001199             MOVE  1  TO  ISBREAK
001200           END-IF
001201         WHEN '3'
001204           IF  KEY1 OF V-REC01-IN NOT = KEY1 OF SV-REC  OR
001205               KEY2 OF V-REC01-IN NOT = KEY2 OF SV-REC  OR
001207               KEY3 OF V-REC01-IN NOT = KEY3 OF SV-REC  THEN
001208             MOVE  1  TO  ISBREAK
001209           END-IF
001210         WHEN OTHER
001211           CONTINUE
001212         END-EVALUATE
001213       END-IF
001214     END-PERFORM
001220
001230     CONTINUE.
001240 SORTIN-END.
001250     ACCEPT  TIMEVAL  FROM  TIME
001260     DISPLAY  ' SORTI-ENDED:' N-SORT ':' TIMEVAL
001270*
001280     EXIT SECTION.
001290 SORT-INPUT-E.
001300/
001310 SORT-OUTPUT       SECTION.
001320*
001330     ACCEPT  TIMEVAL  FROM  TIME
001340     DISPLAY  ' SORTO-START:' N-SORT ':' TIMEVAL.
001350*
001360 LOOP-ST.
001370     RETURN  SORT-FILE
001380         AT  END  GO TO SORTOUT-END
001390     END-RETURN
001400
001410     MOVE  V-SORT  TO  V-LLOT
001420     MOVE  SORT-REC(1:V-SORT)  TO  V-REC01-OT(1:V-LLOT)
001430
001440     WRITE  V-REC01-OT
001450     GO  TO  LOOP-ST
001460
001470     CONTINUE.
001480 SORTOUT-END.
001490
001500     ACCEPT  TIMEVAL  FROM  TIME
001510     DISPLAY  ' SORTO-ENDED:' N-sort ':' TIMEVAL
001520*
001530     EXIT SECTION.
001540 SORT-OUTPUT-E.
001550/
001560 EXIT-PROGRAM.
