000001 @OPTIONS SOURCE,MESSAGE,COPY,MAP,NOOBJECT,LIST 
000010 IDENTIFICATION   DIVISION.      
000020 PROGRAM-ID.      COBMAP.        
000030 ENVIRONMENT      DIVISION.      
000040 DATA             DIVISION.      
000050 WORKING-STORAGE  SECTION.       
000051 01  _COPYMAP_.                  
000060     COPY  vfile .                  
000070 PROCEDURE        DIVISION.      
000080     CONTINUE                   
